<!DOCTYPE html> 
<html> 
<head> 
<meta charset="utf-8"> 
<title>Что такое seo и как оптимизировать сайт?</title> 
<meta name="description" content="Что такое seo, как оптимизировать сайт, что такое ключевые слова, полезные советы начинающим"/>
<link rel="stylesheet" href="/css/learning.css">
<style> 

</style> 
</head> 

<body>

<div>
    <h1>SEO</h1>
    <ul>
        <li><a href="#link">Содержание сайта</a></li>
        <li><a href="#head">Название страницы сайта</a></li>
        <li><a href="#meta_tag_desc">Мета-тег описания страницы</a></li>
        <li><a href="#word_key">Мета тег keywords</a></li>
        <li><a href="#headers">Заголовки страницы сайта</a></li>
        <li><a href="#word_content">Ключевые слова в контенте</a></li>
        <li><a href="#img">Изображения</a></li>
        <li><a href="#img">Донорные страницы и перелинковка</a></li>
        <li><a href="#word">Семантическое ядро</a></li>
        <li><a href="#word">Комплексное продвижение сайта</a></li>
        <li><a href="#img">Регистрация сайта</a></li>
        <li><a href="#link">Полезные ссылки</a></li>
    </ul>
</div>

<div>
    <h3>Содержание сайта</h3>
    <p>
        Привлекательность сайта. Интересные статьи, блоги, обзоры. Возраст сайт оказывает влияние на дальнейшее продвижение. Следует сделать анализ ваших конкурентов, разобрать содержание их
         сайтов, за счет чего они находятся в топе и какие ключевые слова, фразы используют. Чтобы сайт был трастовый, мало заинтересовать поисковики правильным контентом, нужно заинтересовать 
         посещаемого, какой нибудь интересной статьей по теме, чтобы ему было проще сделать выбор. На сайте должны быть коментарии, иначе говоря сайт должен жить, меняться.
    </p>
</div>
<div>
    <h3>Название страницы сайта</h3>
    <p>
        Название сайта, больше всего связано с тематикой сайта. Чтобы обозначить заголовок страницы, используется тег title, непример: <span>&lt;title&gt;ВЧ - СЧ,НЧ&lt;/title&gt;</span>
        Т.е., первое слово в заголовке это суть содержания страницы, магазин часов, значит часы, далее НЧ(низкочастотные) женские часы, мужские часы, купить и т.д.
        Данный заголовок используется поисковыми системами, для опредения тематики сайта. В результатах поиска, этот заголовок и есть ссылка, которую пользователь нажимает для перехода на сайт.
        Все ключевые слова, которые используются на сайте, должны соответствовать теме заголовка. Для большей эфективности, используй в заголовке ключевые слова. У каждой страницы сайта, 
        должен быть свой заголовок, т.е. титл должен быть уникальным. Тег title и тег h1-h... не должны совпадать содержанием, но нужно учитывать, что важные слова нужно опысывать в обоих 
        тегах, они равны по значимости.
    </p>
</div>
<div>
    <h3>Мета-тег описания страницы</h3>
    <p>
        <span>&lt;meta name=»description» content=»Описание страницы сайта»/&gt;</span>
    </p>
    <p>Описание должно содержать ключевые слова. К тому же данный текст должен отличаться от описания в заголовке страницы и от описания в первом абзаце страницы.</p>
</div>
<div>
    <h3>Мета тег keywords</h3>
    <p>
        <span>&lt;meta name=»keywords» content=»список ключевых слов»/&gt;</span>
    </p>
    <p>
        Именно в этом теге описываются ключевые слова, можно через запятую с пробелом, можно просто через пробел, полезность этого тега, остается под вопросом, так как в интернете всюду 
        пишут, что данный тег уже неактуален, однако точно никому не известно используется этот тег в google или yandex поисковиках. Ключевые слова, которые содержатся в теге keywords, должны 
        присутствовать в основном контексте и заголовках.
    </p>
</div>
<div>
    <h3>Заголовки страницы сайта</h3>
    <p>
        Немаловажным способом, для обозначения ключевых слов является использование заголовков страницы. <span>&lt;h1&gt;&lt;/h1&gt;</span>
    </p>
</div>
<div>
    <h3>Ключевые слова в контенте</h3>
    <p>
        В основном контенте страницы, должны использоваться ключевые слова, но и слишком много их лепить тоже не надо. Используются не только ключевые слова, но и фразы, которые 
        посетитель, чаще всего использует для поиска информации. Ключевые слова следует писать в первом заголовке страницы. Где описывается магазин или свойство товара. 
        В тоже время ключевые слова на главной странице, могут быть ссылками на подразделы, описание которых соответствует ключевому слову. Ключевое слово в тексте страницы, не должно быть разбито 
        на несколько частей или не должно склоняться в другом падеже. 
    </p>
</div>
<div>
    <h3>Изображения</h3>
    <p>
        Для изображений используй атрибут <span>"alt"</span>, максимальная длина описания должна быть минимальной, а само описание должно быть наиболее понятным. Рекомендуемая длина 50-120. 
        Данный атрибут, добавляется в конце тега изображения. В описании alt можно прописать ключевое слово, которое есть в окружаемом тексте в яндекс картинках, существует своя поисковая система, 
        которая учитывает этот атрибут.
        
    </p>
</div>
<div>
    <h3>Донорные страницы и перелинковка</h3>
    <p>
        Страницы, которые не продвигаются, они нужны для перехода на продвигаемые страницы.
    </p>
</div>
<div>
    <h3>Семантическое ядро</h3>
    <p><a name="word"></a>
        Ключевые слова, слова, которые пользователи чаще всего используют в поисковиках. 
        К ним относятся ВН(высокочастотные) и НЧ(низкочастотные). Под частотой имеется ввиду, 
        колличество запросов. Частота зависит от таких факторов, как регион, тематика, поисковая система...
        </p>
        <p><span>Чтобы проверить частотность какого либо слова, многие воспользутся сервисом <a href="https://wordstat.yandex.ru/" target="_blank"><b>wordstat</b></a></span></p>
<p>
Чтобы воспользоваться данным данным сервисом, необходимо зарегистрироваться на яндексе, как обычный пользователь.
Использовать нужно как НЧ так и ВЧ и наверное даже СЧ(среднечастотные). Почему? Ну например если вы вводите слово часы, поисковик покажет вам, все что связано с часами,
 а если вы вводите в строке запроса "купить часы наручные женские механические" то сайтов буде куда меньше и это будут в основном интернет-магазины, у которых есть женские часы механические.
  Если у вас в продаже есть часы скелетоны, так почему бы не добавить слово "скелетоны"?. Если у тебя интернет магазин часов, то низкочастотные слова используется в карточке определенного товара, 
  а высокачастотные в каталоге товаров. Получается, что главная страница содержит, только общее описание запросов, например часы мужские и часы женские, ремешки.
</p>
<p>
<ol>
    <li>Низкочастотные: 100 показов в месяц</li>
    <li>Среднечастотные: до 1000 показов в месяц</li>
    <li>Высокочастотные: более чем 1000</li>
</ol>
</p>
</div>
<div>
    <h3>Комплексное продвижение сайта</h3>
    <p>
Яндекс.Директ<br>
AdWords<br>
Банеры<br>
Продвижение сайта в социальных сетях
    </p>
</div>
<div>
    <h1>Регистрация сайта</h1>
    <p>
        <a href="http://webmaster.yandex.ru/addurl.xml" target="_blank"><span><b>Регистрация сайта в поисковой системе Яндекс</b></span></a>
    </p>
    <p>
        <a href="http://www.google.ru/addurl/" target="_blank"><span><b>Регистрация сайта в поисковой системе Google</b></span></a>
    </p>
    <p>
        <a href="http://go.mail.ru/addurl" target="_blank"><span><b>Регистрация сайта в поисковой системе mail</b></span></a>
    </p>
</div>
<div>
    <h3>Полезные ссылки</h3>
    <p>
         <a href="https://seo.ru/chto-takoe-seo/" target="_blank"><span><b>Немного о SEO</b></span></a>
    </p>
     <p>
         <a href="http://blogarbik.ru/?page_id=1860" target="_blank"><span><b>Онлайн учебник SEO</b></span></a>
    </p>
    <p>
         <a href="https://yandex.ru/adv/edu/webmaster/webmaster-optimization" target="_blank"><span><b>Основные принципы оптимизации сайта</b></span></a>
    </p>
    <p>
    <a href="https://wordstat.yandex.ru/" target="_blank"><span><b>Подбор ключевых слов</b></span></a>
    </p>
    <p>
         <a href="https://webmaster.yandex.ru/#siteserp" target="_blank"><span><b>Анализ сайта в Яндексе</b></span></a>
    </p>
      <p>
    <a href="https://search.google.com/search-console/welcome" target="_blank"><span><b>Анализ сайта в Google</b></span></a>
    </p>
    <p>
    <a href="http://blogarbik.ru/?p=1475" target="_blank"><span><b>Продвижение сайта ссылками</b></span></a>
    </p>
</div>

</body> 
</html>